irvynX/ESP32/controladorCuarto/src/main.cpp
  //MDNS.addService("http", "tcp", 80);

  // preparar entradas
  pinMode(microfono, INPUT);
  pinMode(rele, OUTPUT);

  pixelsReloj.begin();
  pixelsReloj.setBrightness(1);
  pixelsReloj.show();
  
  pixelsG.begin();
  pixelsE.begin();

  pixelsG.show();
  pixelsE.show();
}


//------------------------------------------mostrar numero en pantalla --------------
void mostrarNumero(int num, int x, int y) {
  for (int i = 0; i < 5; i++) {
    for (int j = 0; j < 3; j++) {
      if (num0_9[num][i][j] == 1) {
        if ((j+ (x-1) + (relojX * i) + (relojX * (y-1))) <= (y+i) * relojX && (j+ (x-1) + (relojX * i) + (relojX * (y-1))) > (y+i-1) * relojX) {
          pixelsReloj.setPixelColor((j+ (x-1) + (relojX * i) + (relojX * (y-1))), 150, 150, 150);
        }
      }
    }
  }
}

//------------------------------------------mostrar logo en pantalla --------------
void mostrarLogo(int num, int x, int y) {
  for (int i = 0; i < 5; i++) {
    for (int j = 0; j < 3; j++) {
      if (logo[num][i][j] == 1) {
        if ((j+ (x-1) + (relojX * i) + (relojX * (y-1))) <= (y+i) * relojX && (j+ (x-1) + (relojX * i) + (relojX * (y-1))) > (y+i-1) * relojX) {
          pixelsReloj.setPixelColor((j+ (x-1) + (relojX * i) + (relojX * (y-1))), 150, 150, 150);
        }
      }
    }
  }
}


// metodos simples --------------------------------------------
void encedeApagarTiraG()
{
  if (encenderG == 1)
  {
    encenderG = 0;
  }
  else
  {
    encenderG = 1;
  }
}

void encedeApagarTiraE()
{
  if (encenderE == 1)
  {
    encenderE = 0;
  }
  else
  {
    encenderE = 1;
  }
}

void encedeApagarFoco()
{
  if (estadoRele == 1)
  {
    estadoRele = 0;
  }
  else
  {
    estadoRele = 1;
  }
}

void cambiarEfectoG()
{
  estadoG++;
  if (estadoG > 4)
  {
    estadoG = 0;
  }
}

void cambiarEfectoE()
{
  estadoE++;
  if (estadoE > 4)
  {
    estadoE = 0;
  }
}

void encenderRele(){
  digitalWrite(rele, LOW);
}

void apagarRele(){
  digitalWrite(rele, HIGH);
}

int leerMicro()
{
  // Leer el nivel de audio desde el micrófono
  int nivelAudio = analogRead(microfono) * mulMicrofono;
  //Serial.println(nivelAudio);
  if (nivelAudio < 0){
    nivelAudio = 0;
  }
  if (nivelAudio > 4000){
    nivelAudio = 4000;
  }
  // Convertir el nivel de audio en la cantidad de LED que se deben encender
  int cantidadLEDs = map(nivelAudio, 0, 4000, 0, numLeds-1);
  // Serial.println("microfono: " + cantidadLEDs);

  return cantidadLEDs;
}

void hexaRGB (String valor){
  String hexColor = "#"; // valor hexadecimal
  hexColor = hexColor + valor;
  long number = (long) strtol(&hexColor[1], NULL, 16); // Convertir hexadecimal a decimal
  int r = (number >> 16) & 255; // Obtener valor de rojo
  int g = (number >> 8) & 255; // Obtener valor de verde
  int b = number & 255; // Obtener valor de azul

  Serial.print(r); // Imprimir valor de rojo en la consola serie
  Serial.print(",");
  Serial.print(g); // Imprimir valor de verde en la consola serie
  Serial.print(",");
  Serial.println(b); // Imprimir valor de azul en la consola serie

  rojoTemp = r;
  verdeTemp = g;
  azulTemp = b;
}

void RGBhexa(int r, int g, int b) {
  char hexR[3];
  char hexG[3];
  char hexB[3];
  
  sprintf(hexR, "%02X", r);
  sprintf(hexG, "%02X", g);
  sprintf(hexB, "%02X", b);

  valorHexa = "#" + String(hexR) + String(hexG) + String(hexB); // Combinar con "#" y la cadena con ceros a la izquierda
  Serial.println(valorHexa);
}

void obtenerHora() {
    HTTPClient http;

    http.begin("http://worldtimeapi.org/api/timezone/America/Mexico_City");

    int httpCode = http.GET();

    if (httpCode == HTTP_CODE_OK)
    {
        String payload = http.getString();

        DynamicJsonDocument doc(1024);
        DeserializationError error = deserializeJson(doc, payload);

        if (!error)
        {
            String horaCompleta = doc["datetime"];

            hora = horaCompleta.substring(11, 13).toInt();
            minutos = horaCompleta.substring(14, 16).toInt();
            if (hora > 12)
            {
              hora -= 12;
            }
            if (tempMinutos != minutos){
              cambioDeMinuto = 10000/intervaloPantalla;
              tempMinutos = minutos;
            }

            Serial.print(hora);
            Serial.print(":");
            Serial.println(minutos);
        }
        else
        {
            Serial.println("Error parsing JSON");
        }
    }
    else
    {
        Serial.println("HTTP request failed");
    }

    http.end();
}

//-----------------------------------metodos de los efectos --------------------------------

//-----------------------------------efecto Musica -----------------------------------------
void efectoMusica(Adafruit_NeoPixel &miPixels, int num)
{
  tiempoActualMusica = millis();
  if (tiempoActualMusica - tiempoPrevioMusica >= intervaloMusica){
    encenderLeds = leerMicro();
    int encenderLeds = (encenderLeds + ultimosEncenderLeds[0] + ultimosEncenderLeds[1] + ultimosEncenderLeds[2] + ultimosEncenderLeds[3] + ultimosEncenderLeds[4] + ultimosEncenderLeds[5] + ultimosEncenderLeds[6] + ultimosEncenderLeds[7] + ultimosEncenderLeds[8] + ultimosEncenderLeds[9] + ultimosEncenderLeds[10] + ultimosEncenderLeds[11] + ultimosEncenderLeds[12] + ultimosEncenderLeds[13] + ultimosEncenderLeds[14] + ultimosEncenderLeds[15] + ultimosEncenderLeds[16] + ultimosEncenderLeds[17] + ultimosEncenderLeds[18] + ultimosEncenderLeds[19] / 21);
    for (int i = 0; i < 19; i++){
      ultimosEncenderLeds[i+1] = ultimosEncenderLeds[i]; 
    }
    ultimosEncenderLeds[0] = encenderLeds;
  }
  if (num == 1)
  {
    // tiraG efecto 1
    miPixels.fill(miPixels.Color(rojoG, verdeG, azulG), 0, encenderLeds);
    miPixels.fill(miPixels.Color(0, 0, 0), encenderLeds, numLeds);
    miPixels.show();
  }
  if (num == 2)
  {
    // tiraG efecto 2
    miPixels.fill(miPixels.Color(rojoG, verdeG, azulG), 0, numLeds);
    miPixels.setBrightness(map(encenderLeds, 0, numLeds, 0, 255));
    miPixels.show();
  }
  if (num == 3)
  {
    // tiraE efecto 1
    miPixels.fill(miPixels.Color(rojoE, verdeE, azulE), 0, encenderLeds);
    miPixels.fill(miPixels.Color(0, 0, 0), encenderLeds, numLeds);
    miPixels.show();
  }
  if (num == 4)
  {
    // tiraE efecto 2
    miPixels.fill(miPixels.Color(rojoE, verdeE, azulE), 0, numLeds);
    miPixels.setBrightness(map(encenderLeds, 0, numLeds, 0, 255));
    miPixels.show();
  }
  int tam1 = map(encenderLeds, 0, numLeds, 0, numLedsReloj);
  int tam2 = map(ultimosEncenderLeds[1], 0, numLeds, 0, numLedsReloj);
  int tam3 = map(ultimosEncenderLeds[2], 0, numLeds, 0, numLedsReloj);
  int tam4 = map(ultimosEncenderLeds[3], 0, numLeds, 0, numLedsReloj);
  int tam5 = map(ultimosEncenderLeds[4], 0, numLeds, 0, numLedsReloj);

