irvynX/ESP32/controladorCuarto/src/main.cpp
  // Calcular los nuevos tamaños de tam2 a tam5
  int nuevoTam2 = (tam2 + tam1) / 2;
  int nuevoTam3 = (tam3 + nuevoTam2) / 2;
  int nuevoTam4 = (tam4 + nuevoTam3) / 2;
  int nuevoTam5 = (tam5 + nuevoTam4) / 2;

  if(encenderReloj == 1){
    // de izquierda a derecha
    pixelsReloj.fill(pixelsReloj.Color(rojoG, verdeG, azulG), 0, nuevoTam4);
    pixelsReloj.fill(pixelsReloj.Color(0, 0, 0), nuevoTam4, relojX);

    pixelsReloj.fill(pixelsReloj.Color(rojoG, verdeG, azulG), relojX, nuevoTam2 + (relojX + 1));
    pixelsReloj.fill(pixelsReloj.Color(0, 0, 0), nuevoTam2 + (relojX), relojX * 2);

    pixelsReloj.fill(pixelsReloj.Color(rojoG, verdeG, azulG), relojX * 2, tam1 + (relojX * 2 + 1));
    pixelsReloj.fill(pixelsReloj.Color(0, 0, 0), tam1 + (relojX * 2), relojX * 3);

    pixelsReloj.fill(pixelsReloj.Color(rojoG, verdeG, azulG), relojX * 3, nuevoTam3 + (relojX * 3 + 1));
    pixelsReloj.fill(pixelsReloj.Color(0, 0, 0), nuevoTam3 + (relojX * 3), relojX * 4);

    pixelsReloj.fill(pixelsReloj.Color(rojoG, verdeG, azulG), relojX * 4, nuevoTam5 + (relojX * 4 + 1));
    pixelsReloj.fill(pixelsReloj.Color(0, 0, 0), nuevoTam5 + (relojX * 4), relojX * 5);

    if (cambioDeMinuto > 0)
    {
      int pos = map(cambioDeMinuto,0,10000/intervaloPantalla,0,35);
      if (pos > 28)
      {
        mostrarNumero((minutos/10),5,(1 - pos) + 28);
        mostrarNumero((minutos%10),8,(1 - pos) + 28);
        mostrarNumero((hora/10),(5 + pos) - 35,1);
        mostrarNumero((hora%10),(8 - pos) + 35,1);
      }else if (pos < 7){
        mostrarNumero((minutos/10),5,(1 + pos) - 7);
        mostrarNumero((minutos%10),8,(1 + pos) - 7);
        mostrarNumero((hora/10),(5 - pos),1);
        mostrarNumero((hora%10),(8 + pos),1);
      }else{
        mostrarNumero((minutos/10),5,1);
        mostrarNumero((minutos%10),8,1);
      }
      
      cambioDeMinuto -= 1;
    }else{
      mostrarNumero((hora/10),5,1);
      mostrarNumero((hora%10),8,1);
    }
    pixelsReloj.setBrightness(3);
    pixelsReloj.show();
  }

}
//-----------------------------------efecto llenar tira -----------------------------------------
void llenarTira(Adafruit_NeoPixel &miPixelsG,Adafruit_NeoPixel &miPixelsE){
  tiempoActualLlenar = millis();
  if (tiempoActualLlenar - tiempoPrevioLlenar >= intervaloLlenar){
    if(estadoG == 3){
      miPixelsG.setPixelColor(ledLlenar - 4, rojoG/16, verdeG/16, azulG/16);
      miPixelsG.setPixelColor(ledLlenar - 3, rojoE/8, verdeE/8, azulE/8);
      miPixelsG.setPixelColor(ledLlenar - 2, rojoE/4, verdeE/4, azulE/4);
      miPixelsG.setPixelColor(ledLlenar - 1, rojoE/2, verdeE/2, azulE/2);
      miPixelsG.setPixelColor(ledLlenar, rojoE, verdeE, azulE);
      miPixelsG.show();
    }
    if(estadoE == 3){
      miPixelsE.setPixelColor(ledLlenar - 4, rojoE/16, verdeE/16, azulE/16);
      miPixelsE.setPixelColor(ledLlenar - 3, rojoG/8, verdeG/8, azulG/8);
      miPixelsE.setPixelColor(ledLlenar - 2, rojoG/4, verdeG/4, azulG/4);
      miPixelsE.setPixelColor(ledLlenar - 1, rojoG/2, verdeG/2, azulG/2);
      miPixelsE.setPixelColor(ledLlenar, rojoG, verdeG, azulG);
      miPixelsE.show();
    }
    ledLlenar++;
    if (ledLlenar > numLeds)
    {
      miPixelsE.setPixelColor(numLeds - 4, rojoE/16, verdeE/16, azulE/16);
      miPixelsE.setPixelColor(numLeds - 3, rojoE/16, verdeE/16, azulE/16);
      miPixelsE.setPixelColor(numLeds - 2, rojoE/16, verdeE/16, azulE/16);
      miPixelsE.setPixelColor(numLeds - 1, rojoE/16, verdeE/16, azulE/16);

      miPixelsG.setPixelColor(numLeds - 4, rojoG/16, verdeG/16, azulG/16);
      miPixelsG.setPixelColor(numLeds - 3, rojoG/16, verdeG/16, azulG/16);
      miPixelsG.setPixelColor(numLeds - 2, rojoG/16, verdeG/16, azulG/16);
      miPixelsG.setPixelColor(numLeds - 1, rojoG/16, verdeG/16, azulG/16);

      miPixelsE.show();

      ledLlenar = 0;
    }
    tiempoPrevioLlenar = millis();
  }
}

//-----------------------------------efecto respirar tira -----------------------------------------
void repirar(){
  tiempoActualRes = millis();
  if (tiempoActualRes - tiempoPrevioRes >= intervaloRes)
  {
    if (estadoG == 4)
    {
      pixelsG.fill(pixelsG.Color(rojoG, verdeG, azulG), 0, numLeds);
      pixelsG.setBrightness(brillo);
      pixelsG.show();
    }
    if (estadoE == 4)
    {
      pixelsE.fill(pixelsE.Color(rojoE, verdeE, azulE), 0, numLeds);
      pixelsE.setBrightness(brillo);
      pixelsE.show();
    }
    Serial.println(brillo);
    if (respirar == true)
    {
      brillo++;
      if (brillo > 254)
      {
        respirar = false;
      }
    }
    else
    {
      brillo--;
      if (brillo < 1)
      {
        respirar = true;
      }
    }
    tiempoPrevioRes = millis();
  }
}

//----------------------------------- metodos para resporder y leer el cliente -------------------
//----------------------------------- metodo para enviar la pagina al cliente -------------------
void ResponderCliente(WiFiClient &cliente){
  cliente.print(pagina1);
  if(estadoRele == 1){
    cliente.print("checked");
  }
  cliente.print(pagina2);
  if(estadoRele == 0){
    cliente.print("checked");
  }
  cliente.print(pagina3);
  if(encenderE == 1){
    cliente.print("checked");
  }
  cliente.print(pagina4);
  if(encenderE == 0){
    cliente.print("checked");
  }
  cliente.print(pagina5);
  if(estadoE == 0){
    cliente.print("checked");
    cliente.print(pagina6);
    cliente.print(pagina7);
    cliente.print(pagina8);
    cliente.print(pagina9);
  }
  if(estadoE == 1){
    cliente.print(pagina6);
    cliente.print("checked");
    cliente.print(pagina7);
    cliente.print(pagina8);
    cliente.print(pagina9);
  }
  if(estadoE == 2){
    cliente.print(pagina6);
    cliente.print(pagina7);
    cliente.print("checked");
    cliente.print(pagina8);
    cliente.print(pagina9);
  }
  if(estadoE == 3){
    cliente.print(pagina6);
    cliente.print(pagina7);
    cliente.print(pagina8);
    cliente.print("checked");
    cliente.print(pagina9);
  }
  if(estadoE == 4){
    cliente.print(pagina6);
    cliente.print(pagina7);
    cliente.print(pagina8);
    cliente.print(pagina9);
    cliente.print("checked");
  }
  cliente.print(pagina10);
  cliente.print(brilloE);
  cliente.print(pagina11);
  RGBhexa(rojoE, verdeE, azulE);
  cliente.print(valorHexa);
  cliente.print(pagina12);
  if(encenderG == 1){
    cliente.print("checked");
  }
  cliente.print(pagina13);
  if(encenderG == 0){
    cliente.print("checked");
  }
  cliente.print(pagina14);
  if(estadoG == 0){
    cliente.print("checked");
    cliente.print(pagina15);
    cliente.print(pagina16);
    cliente.print(pagina17);
    cliente.print(pagina18);
  }
  if(estadoG == 1){
    cliente.print(pagina15);
    cliente.print("checked");
    cliente.print(pagina16);
    cliente.print(pagina17);
    cliente.print(pagina18);
  }
  if(estadoG == 2){
    cliente.print(pagina15);
    cliente.print(pagina16);
    cliente.print("checked");
    cliente.print(pagina17);
    cliente.print(pagina18);
  }
  if(estadoG == 3){
    cliente.print(pagina15);
    cliente.print(pagina16);
    cliente.print(pagina17);
    cliente.print("checked");
    cliente.print(pagina18);
  }
  if(estadoG == 4){
    cliente.print(pagina15);
    cliente.print(pagina16);
    cliente.print(pagina17);
    cliente.print(pagina18);
    cliente.print("checked");
  }
  cliente.print(pagina19);
  cliente.print(brilloG);
  cliente.print(pagina20);
  RGBhexa(rojoG, verdeG, azulG);
  cliente.print(valorHexa);
  cliente.print(pagina21);
  cliente.print(mulMicrofono);
  cliente.print(pagina22);
  cliente.print(horaSumar);
  cliente.print(pagina23);
  cliente.print(minSumar);
  cliente.print(pagina24);
}

