irvynX/ESP32/controladorCuarto/src/main.cpp
//---------------------------------- verificacion de los mensajes ---------------------------
void VerificarMensaje(String Mensaje)
{
  int mensaje;
  int cont = 0;
  String temp;
  //codigo oculto
  if (Mensaje.indexOf("reloj") >= 0)
  {
    if(encenderReloj == 0){
      encenderReloj = 1;
    }else{
      encenderReloj = 0;
    }
  }
  if (Mensaje.indexOf("apagarFoco") >= 0)
  {
    estadoRele = 0;
  }
  if (Mensaje.indexOf("encenderFoco") >= 0)
  {
    estadoRele = 1;
  }
  if (Mensaje.indexOf("encenderLuces") >= 0){
    encenderG = 1;
    encenderE = 1;
  }
  if (Mensaje.indexOf("apagarLuces") >= 0){
    encenderG = 0;
    encenderE = 0;
  }
  if (Mensaje.indexOf("fueraCasa") >= 0){
    encenderG = 0;
    encenderE = 0;
    estadoRele = 0;
  }
  if (Mensaje.indexOf("enCasa") >= 0){
    encenderG = 1;
    encenderE = 1;
    estadoRele = 1;
  }
  if (Mensaje.indexOf("cambiarEfecto") >= 0){
    cambiarEfectoE();
    cambiarEfectoG();
  }
  if (Mensaje.indexOf("notificacion:") >= 0){
    if (Mensaje.indexOf("notificacion:Youtube") >= 0){
      if (notificacion == 0){
        numLogo = 0;
        notificacion = 10000/intervaloPantalla;
        encendidoETemp = encenderE;
        encendidoGTemp = encenderG;
        rojoETemp = rojoE;
        verdeETemp = verdeE;
        azulETemp = azulE;
        rojoGTemp = rojoG;
        verdeGTemp = verdeG;
        azulGTemp = azulG;
        encenderE = 1;
        encenderG = 1;
      }      
    }
    if (Mensaje.indexOf("notificacion:Facebook") >= 0){
      if (notificacion == 0){
        numLogo = 1;
        notificacion = 10000/intervaloPantalla;
        encendidoETemp = encenderE;
        encendidoGTemp = encenderG;
        rojoETemp = rojoE;
        verdeETemp = verdeE;
        azulETemp = azulE;
        rojoGTemp = rojoG;
        verdeGTemp = verdeG;
        azulGTemp = azulG;
        encenderE = 1;
        encenderG = 1;
      }
    }
    if (Mensaje.indexOf("notificacion:Whatsapp") >= 0){
      if (notificacion == 0){
        numLogo = 2;
        notificacion = 10000/intervaloPantalla;
        encendidoETemp = encenderE;
        encendidoGTemp = encenderG;
        rojoETemp = rojoE;
        verdeETemp = verdeE;
        azulETemp = azulE;
        rojoGTemp = rojoG;
        verdeGTemp = verdeG;
        azulGTemp = azulG;
        encenderE = 1;
        encenderG = 1;
      }
    }
  }
  
  //codigo normal
  if (Mensaje.indexOf("?foco") >= 0){
    if(Mensaje.indexOf("foco=1") >= 0){
      estadoRele = 1;
      Serial.println("rele encendido");
    }else{
      estadoRele = 0;
      Serial.println("rele apagado");
    }
  }else if(Mensaje.indexOf("?tiraE") >= 0){
    if(Mensaje.indexOf("tiraE=1") >= 0){
      Serial.println("tira E: encendido");
      encenderE = 1;
    }else{
      encenderE = 0;
      Serial.println("tira E: apagado");
    }

    if(Mensaje.indexOf("efecto=0") >= 0){
      estadoE = 0;
      Serial.println("efecto 0");
    }else if(Mensaje.indexOf("efecto=1") >= 0){
      estadoE = 1;
      Serial.println("efecto 1");
    }else if(Mensaje.indexOf("efecto=2") >= 0){
      estadoE = 2;
      Serial.println("efecto 2");
    }else if(Mensaje.indexOf("efecto=3") >= 0){
      estadoE = 3;
      Serial.println("efecto 3");
    }else{
      estadoE = 4;
      Serial.println("efecto 4");
    }

    mensaje = Mensaje.indexOf("color=");
    temp = Mensaje[mensaje + 9];
    temp += Mensaje[mensaje + 10];
    temp += Mensaje[mensaje + 11];
    temp += Mensaje[mensaje + 12];
    temp += Mensaje[mensaje + 13];
    temp += Mensaje[mensaje + 14];
    Serial.println(temp);
    hexaRGB(temp);
    rojoE = rojoTemp;
    verdeE = verdeTemp;
    azulE = azulTemp;

    mensaje = Mensaje.indexOf("brillo=");
    temp = Mensaje[mensaje + 7];
    if(Mensaje[mensaje + 8] != '&'){
      temp += Mensaje[mensaje + 8];
    }
    if(Mensaje[mensaje + 9] != '&'){
      temp += Mensaje[mensaje + 9];
    }
    Serial.println(temp);
    brilloE = temp.toInt();
  }else if(Mensaje.indexOf("?tiraG") >= 0){
    if(Mensaje.indexOf("tiraG=1") >= 0){
      encenderG = 1;
      Serial.println("tira G: encendida");
    }else{
      encenderG = 0;
      Serial.println("tira G: apagado");
    }

    if(Mensaje.indexOf("efecto=0") >= 0){
      estadoG = 0;
      Serial.println("efecto 0");
    }else if(Mensaje.indexOf("efecto=1") >= 0){
      estadoG = 1;
      Serial.println("efecto 1");
    }else if(Mensaje.indexOf("efecto=2") >= 0){
      estadoG = 2;
      Serial.println("efecto 2");
    }else if(Mensaje.indexOf("efecto=3") >= 0){
      estadoG = 3;
      Serial.println("efecto 3");
    }else{
      estadoG = 4;
      Serial.println("efecto 4");
    }

    mensaje = Mensaje.indexOf("color=");
    temp = Mensaje[mensaje + 9];
    temp += Mensaje[mensaje + 10];
    temp += Mensaje[mensaje + 11];
    temp += Mensaje[mensaje + 12];
    temp += Mensaje[mensaje + 13];
    temp += Mensaje[mensaje + 14];
    Serial.println(temp);
    hexaRGB(temp);
    rojoG = rojoTemp;
    verdeG = verdeTemp;
    azulG = azulTemp;

    mensaje = Mensaje.indexOf("brillo=");
    temp = Mensaje[mensaje + 7];
    if(Mensaje[mensaje + 8] != '&'){
      temp += Mensaje[mensaje + 8];
    }
    if(Mensaje[mensaje + 9] != '&'){
      temp += Mensaje[mensaje + 9];
    }
    Serial.println(temp);
    brilloG = temp.toInt();
  }else if(Mensaje.indexOf("?micro") >= 0){
    mensaje = Mensaje.indexOf("micro=");
    cont = 0;
    temp = "";
    while(Mensaje[mensaje + 6 + cont] != '&'){
      temp += Mensaje[mensaje + 6 + cont];
      cont++;
    }
    Serial.println("micro: " + temp);
    mulMicrofono = temp.toInt();

    mensaje = Mensaje.indexOf("hora=");
    cont = 0;
    temp = "";
    while(Mensaje[mensaje + 5 + cont] != '&'){
      temp += Mensaje[mensaje + 5 + cont];
      cont++;
    }
    Serial.println("hora: " + temp);
    horaSumar = temp.toInt();

    mensaje = Mensaje.indexOf("minuto=");
    cont = 0;
    temp = "";
    while(Mensaje[mensaje + 7 + cont] != '&'){
      temp += Mensaje[mensaje + 7 + cont];
      cont++;
    }
    Serial.println("minuto: " + temp);
    minSumar = temp.toInt();

