irvynX/ESP32/controladorCuarto/src/main.cpp
  }
}

//------------------------------------------loop----------------------------------

void loop(){
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("Conexión WiFi perdida. Intentando reconexión...");
    WiFi.reconnect();
  }
  WiFiClient cliente = servidor.available();
  // usuario en la pagina web
  if (cliente)
  {
    Serial.println("Nuevo Cliente");
    TiempoActual = millis();
    TiempoAnterior = millis();
    String LineaActual = "";

    while (cliente.connected() && (TiempoActual - TiempoAnterior <= TiempoCancelacion))
    {
      if (cliente.available())
      {
        TiempoActual = millis();
        char Letra = cliente.read();
        if (Letra == '\n')
        {
          if (LineaActual.length() == 0)
          {
            ResponderCliente(cliente); // <---------------------------falta
            break;
          }
          else
          {
            VerificarMensaje(LineaActual); // <---------------------------falta
            LineaActual = "";
          }
        }
        else if (Letra != '\r')
        {
          LineaActual += Letra;
        }
      }
    }

    cliente.stop();
    Serial.println("Cliente Desconectado");
    Serial.println();
  }

  // no hay usuarios en la red

  //obtenemos la hora
  tiempoActualReloj = millis();
  if (tiempoActualReloj - tiempoPrevioReloj > intervaloReloj)
  {
    obtenerHora();
    tiempoPrevioReloj = millis();
  }  

  // pantalla del reloj
  tiempoActualPantalla = millis();
  if (tiempoActualPantalla - tiempoPrevioPantalla > intervaloPantalla)
  {
    if (encenderReloj == 1)
    {
      if (notificacion == 0)
      {
        int porcentajeMinutos = map(minutos,0,60,0,numLedsReloj);
        if (!((encenderE == 1 && (estadoE == 1 || estadoE == 2)) || (encenderG == 1 && (estadoG == 1 || estadoG == 2))))
        { 
          pixelsReloj.fill(pixelsG.Color(rojoG, verdeG, azulG), 0, porcentajeMinutos);
          pixelsReloj.fill(pixelsG.Color(0, 0, 0), porcentajeMinutos, numLedsReloj);
          if (cambioDeMinuto > 0)
          {
            int pos = map(cambioDeMinuto,0,10000/intervaloPantalla,0,35);
            if (pos > 28)
            {
              mostrarNumero((minutos/10),5,(1 - pos) + 28);
              mostrarNumero((minutos%10),8,(1 - pos) + 28);
              mostrarNumero((hora/10),(5 + pos) - 35,1);
              mostrarNumero((hora%10),(8 - pos) + 35,1);
            }else if (pos < 7){
              mostrarNumero((minutos/10),5,(1 + pos) - 7);
              mostrarNumero((minutos%10),8,(1 + pos) - 7);
              mostrarNumero((hora/10),(5 - pos),1);
              mostrarNumero((hora%10),(8 + pos),1);
            }else{
              mostrarNumero((minutos/10),5,1);
              mostrarNumero((minutos%10),8,1);
            }
            
            cambioDeMinuto -= 2;
          }else{
            mostrarNumero((hora/10),5,1);
            mostrarNumero((hora%10),8,1);
          }
        }
      }else{
        switch (numLogo){
        case 0:
          pixelsReloj.fill(pixelsG.Color(255, 0, 0), 0, numLedsReloj);
          rojoE = 255;
          verdeE = 0;
          azulE = 0;
          rojoG = 255;
          verdeG = 0;
          azulG = 0;
          encenderE = 1;
          encenderG = 1;
          break;
        case 1:
          pixelsReloj.fill(pixelsG.Color(0, 0, 255), 0, numLedsReloj);
          rojoE = 0;
          verdeE = 0;
          azulE = 255;
          rojoG = 0;
          verdeG = 0;
          azulG = 255;
          encenderE = 1;
          encenderG = 1;
          break;
        case 2:
          pixelsReloj.fill(pixelsG.Color(0, 255, 0), 0, numLedsReloj);
          rojoE = 0;
          verdeE = 255;
          azulE = 0;
          rojoG = 0;
          verdeG = 255;
          azulG = 0;
          encenderE = 1;
          encenderG = 1;
          break;
        default:
          pixelsReloj.fill(pixelsG.Color(150, 75, 175), 0, numLedsReloj);
          rojoE = 190;
          verdeE = 255;
          azulE = 200;
          rojoG = 146;
          verdeG = 225;
          azulG = 200;
          encenderE = 1;
          encenderG = 1;
          break;
        }
        mostrarLogo(numLogo,1,1);
        mostrarLogo(numLogo,12,1);
        mostrarNumero((hora/10),5,1);
        mostrarNumero((hora%10),8,1);

        if (notificacion == 1){
          encenderE = encendidoETemp;
          encenderG = encendidoGTemp;
          rojoE = rojoETemp;
          verdeE = verdeETemp;
          azulE = azulETemp;
          rojoG = rojoGTemp;
          verdeG = verdeGTemp;
          azulG = azulGTemp;
        }
        

        //reducir notificacion 
        notificacion -= 1;
      }
    }
    else{
      pixelsReloj.clear();
    }
    pixelsReloj.setBrightness(1);
    pixelsReloj.show();
    tiempoPrevioPantalla = millis();
  }

  // tira gabinete
  if (encenderG == 0)
  {
    pixelsG.clear();
    pixelsG.show();
  }
  else if (estadoG == 0 && encenderG == 1)
  {
    pixelsG.fill(pixelsG.Color(rojoG, verdeG, azulG), 0, numLeds);
    pixelsG.setBrightness(brilloG);
    pixelsG.show();
  }
  else if (estadoG == 1 && encenderG == 1)
  {
    // metodo de musica
    pixelsG.setBrightness(brilloG);
    efectoMusica(pixelsG, 1); 
  }
  else if (estadoG == 2 && encenderG == 1)
  {
    // metodo llenar tira leds
    pixelsG.setBrightness(brilloG);
    efectoMusica(pixelsG, 2);
  }
  else if (estadoG == 3 && encenderG == 1)
  {
    // metodo llenar tira leds
    pixelsG.setBrightness(brilloG);
    llenarTira(pixelsG,pixelsE);
  }
  else if (estadoG == 4 && encenderG == 1)
  {
    // encender y apagar
    repirar();
  }

  // tira escritorio
  if (encenderE == 0)
  {
    pixelsE.clear();
    pixelsE.show();
  }
  else if (estadoE == 0 && encenderE == 1)
  {
    pixelsE.fill(pixelsE.Color(rojoE, verdeE, azulE), 0, numLeds);
    pixelsE.setBrightness(brilloE);
    pixelsE.show();
  }
  else if (estadoE == 1 && encenderE == 1)
  {
    // metodo de musica
    pixelsE.setBrightness(brilloE);
    efectoMusica(pixelsE, 3);
  }
  else if (estadoE == 2 && encenderE == 1)
  {
    // metodo llenar tira leds
    pixelsE.setBrightness(brilloE);
    efectoMusica(pixelsE, 4);
  }
  else if (estadoE == 3 && encenderE == 1)
  {
    // metodo llenar tira leds
    pixelsE.setBrightness(brilloE);
    llenarTira(pixelsG,pixelsE);
  }
  else if (estadoE == 4 && encenderE == 1)
  {
    repirar();
  }

  // rele
  if (estadoRele == 0)
  {
    apagarRele();
  }
  else
  {
    encenderRele();
  }

  // leer estado de los botones
  int btnEstado1 = touchRead(T9);
  int btnEstado2 = touchRead(T8);
  int btnEstado3 = touchRead(T7);
  int btnEstado4 = touchRead(T6);
  int btnEstado5 = touchRead(T5);
  int btnEstado6 = touchRead(T4);
  int btnEstado7 = touchRead(T3);


  // realizar acciones en función del estado de los botones
  /*
  if (btnEstado1 < botonLimite)
  {
    encedeApagarTiraG();
    Serial.println("Botón tira 1!");
    delay(250);
  }

  if (btnEstado2 < botonLimite)
  {
    encedeApagarTiraE();
    Serial.println("Botón tira 2!");
    delay(250);
  }

  if (btnEstado3 < botonLimite)
  {
    encedeApagarFoco();
    Serial.println("Botón rele!");
    delay(250);
  }

  if (btnEstado4 < botonLimite)
  {
    encenderG = 1;
    encenderE = 1;
    estadoRele = 1;
    Serial.println("Botón encender todo!");
    delay(250);
  }

  if (btnEstado5 < botonLimite)
  {
    cambiarEfectoE();
    Serial.println("Botón cambiar efecto tira 2!");
    delay(250);
  }

  if (btnEstado6 < botonLimite)
  {
    cambiarEfectoG();
    Serial.println("Botón cambiar efecto tira 1!");
    delay(250);
  }

  if (btnEstado7 < botonLimite)
  {
    encenderG = 0;
    encenderE = 0;
    estadoRele = 0;
    Serial.println("Botón apagar todo!");
    delay(250);
  }
  */
}
